# GetFabricationConnectorGroup Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetFabricationConnectorGroup Method
FabricationConfiguration Class See Also
---
Gets the fabrication connector group from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetFabricationConnectorGroup(
	int fabricationConnectorId
)
```

Visual Basic
---
```text
Public Function GetFabricationConnectorGroup ( _
	fabricationConnectorId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetFabricationConnectorGroup(
	int fabricationConnectorId
)
```

# ### Parameters
fabricationConnectorId
    Type: System..::..Int32 The fabrication connector identifier.
# ### Return Value
The fabrication connector's group.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace